Revit 2024 API
AnalysisDisplayColorEntry Constructor
Overload List
Name | Description
AnalysisDisplayColorEntry()
 Constructs a new AnalysisDisplayColorEntry with default settings.
AnalysisDisplayColorEntry(Color)
 Constructs a color entry with no value assigned.
AnalysisDisplayColorEntry(Color, Double)
 Constructs a color entry with a specific value assigned.
See Also
AnalysisDisplayColorEntry Class
AnalysisDisplayColorEntry Members
Autodesk.Revit.DB.Analysis Namespace